import pandas as pd
import streamlit as st

def paint():
    # будет три цвета
    # orange, red, green
    pass


def filter():
    # пользователь включается кнопку или выбирается из вываливающейся шторки
    # какие камеры он хочет увидеть ( работают, работают некорректно, не работают
    pass


def extra_info():
    # пишет доп инфу об камере
    # пользователь наводит на камеру курсор и вслывает небольшое окно с доп информацией

    pass


def show_map():
    # функция для показа карты с камерами
    pass


def paint_map():
    # функция перекрашивает поток машин
    pass


def extra_info_traffic():
    # пишет доп инфу о пробках, ср скорость и тд
    pass


def button_on():
    # функция включает полнузок со временем
    pass


def button_off():
    # выключает ползунок со временем
    pass


def changer():
    # изменяет время
    pass


